export const SKILL_NAMES: Record<number, string> = {
  1: 'Стремительный марш',
  2: 'Груз',
  3: 'Мастер-партизан',
  4: 'Первая помощь',
  5: 'Надзиратель',
  6: 'Мастер сбора',
  7: 'Мастер стрельбы',
  8: 'Регенерация',
  9: 'Противодействие монстрам',
  10: 'Эксперт по пожарам',
  11: 'Вдохновление',
}

export const SKILL_VALUE_LABELS: Record<number, string> = {
  1: 'Скорость войск',
  2: 'Грузоподъемность',
  3: 'Мощь всех войск',
  4: 'Скорость восстановления',
  5: 'Добыча золота оффлайн',
  6: 'Скорость сбора золота',
  7: 'Мощь лучниц',
  8: 'Восстановленных бойцов',
  9: 'Сокращение трат ОД на монстров',
  10: 'Мощь огненных магов',
  11: 'Мощь гоблинов',
}

export const PLACE_LABELS: Record<number, string> = {
  1: 'Таверна (обычная вербовка)',
  2: 'Таверна (продвинутая вербовка)',
  3: 'Таверна (вербовка по показателям)',
  4: 'Карты самовыбора',
  5: 'VIP',
  6: 'Аукцион',
  7: 'Зал наград',
  8: 'Обычная рулетка (ивент)',
  9: 'Безумная рулетка (ивент)',
  10: 'Хрустальный шар',
  11: 'Колесо фортуны',
}
