import React, { FC, memo } from 'react'
import { Flex, Stack, Text, Title } from '@mantine/core'
import { FaTelegram } from 'react-icons/fa'


interface Props {
  className?: string
}

const AboutPage: FC<Props> = memo(({ className }) => (
  <Stack className={className} gap={8} maw={600}>
    <Title order={1}>Про калькулятор</Title>
    <Text>Добро пожаловать на сайт калькулятора для игры Kingdom Guard!</Text>
    <Text>
      Прежде чем приступить к расчетам, прошу уделить несколько минут времени, и дочитать этот текст. Я хочу кратко
      рассказать про калькулятор и как им пользоваться.
    </Text>
    <Title order={2}>Причина создания</Title>
    <Text>Я решил разработать собственную версию калькулятора, и сделать ее веб-версией по нескольким причинам:</Text>
    <Text>
      <Text component="span" fw={700}>
        - Это удобно.
      </Text>{' '}
      Если на ПК вполне можно удобно заполнять Excel-таблицы, то на мобильных устройствах это уже не так приятно делать.
      Веб-версия калькулятора более удобна как при работе с ПК, так и с мобильных устройств
    </Text>
    <Text>
      <Text component="span" fw={700}>
        - Это быстро.
      </Text>{' '}
      Если Excel-калькуляторы объемные и большие сами по себе, они могут занимать время на то, чтобы всё пересчитать по
      формулам. Веб-приложение работает моментально.
    </Text>
    <Text>
      <Text component="span" fw={700}>
        - Это актуально.
      </Text>{' '}
      Когда в игру добавляются новые герои, или обновляются очки на событиях Сильнейшее королевство/Экстремальная мощь,
      вы можете достаточно просто сами всё актуализировать в веб-приложении. А новых героев добавит разработчик (то есть
      я).
    </Text>
    <Text>
      Хочу отдельно отметить, что калькулятор я делаю в первую очередь для самого себя, а так же для своих друзей по
      альянсу. Поэтому в моих интересах делать его максимально удобным и простым для пользования.
    </Text>
    <Title order={2}>Как пользоваться</Title>
    <Text>
      Калькулятор поделен на несколько разделов. Каждый из них преследует свою цель, поэтому не всегда стоит ими
      пренебрегать.
    </Text>
    <Title order={3}>Инвентарь</Title>
    <Text>
      Раздел с инвентарем содержит в себе все необходимые ресурсы, необходимые для событий Экстремальной мощи и
      Сильнейшего королевства. В калькуляторах эти же ресурсы так же будут представлены, но только те, которые
      необходимы для расчетов в самом калькуляторе. В данном разделе можно сразу заполнить все ресурсы, которые у вас
      имеются. Либо это можно сделать по отдельности в каждом калькуляторе.
    </Text>
    <Title order={3}>Параметры персонажа</Title>
    <Text>
      В данном разделе, по аналогии с инвентарем, представлены все необходимые параметры для расчетов событий. Можно
      заполнить их все сразу на данной странице, либо заполнить их по отдельности в каждом калькуляторе.
    </Text>
    <Title order={3}>Герои</Title>
    <Text>
      Раздел для настройки ваших героев, а так же распределении карт самовыбора. Если вы хотите использовать продвинутый
      режим расчета героев, то данный раздел будет обязательным к заполнению. К сожалению, из-за большого количества
      героев, а так же не очень показательного интерфейса героев в игре, заполнение данного раздела может занять
      продолжительное время. Я постарался упростить заполнение на столько, на сколько возможно.
    </Text>
    <Text>
      Данный раздел можно проигнорировать, если собираетесь использовать упрощенный режим расчета героев. В таком
      случае, в инвентаре нужно вручную заполнить количество карт героев для каждого ранга. Их же можно заполнить в
      калькуляторе героев
    </Text>
    <Title order={3}>Калькулятор</Title>
    <Text>
      Самый главный раздел, содержащий в себе подразделы, а именно - отдельные калькуляторы. Рекомендую ознакомиться с
      каждым из них в отдельности. Некоторые из них по итогам расчетов готовы предоставить вам дополнительную
      вспомогательную информацию. Например, калькулятор дракона подскажет, сколько коробок открывать для получения той
      или иной руны.
    </Text>
    <Text>
      Калькуляторы Сильнейшего королевства и Экстремальной мощи содержат в себе обобщенные результаты расчетов из всех
      остальных калькуляторов. Они нужны, чтобы посмотреть общее количество очков, которые вы можете заработать на
      данных событиях.
    </Text>
    <Title order={3}>Прочее - Калькулятор злых духов</Title>
    <Text>Данный калькулятор не относится к основным, он нужен для отдельного события - Вторжение злых духов.</Text>
    <Text>
      Калькулятор поможет подготовиться к событию, посмотреть и расчитать, на сколько сильные духи будут призваны при
      том или ином уровне. А так же позволит посмотреть, сколько очков на данном событии сможет заработать ваш альянс и
      каждый игрок в отдельности.
    </Text>
    <Title order={3}>Серверные настройки</Title>
    <Text>
      Данный раздел поможет настроить сам калькулятор под вас. Дело в том, что все сервера в игре находятся на разных
      стадиях развития. Из-за этого, у одних могут уже быть открыты более поздние ранги и герои, в то время как у более
      новых серверов открыто еще очень мало. Стандартные же настройки калькулятора заточены под сетку серверов
      1491-1577, по той причине, что сам разработчик играет в этой сетке серверов.
    </Text>
    <Text>
      В данном разделе вы можете настроить ключевые параметры под ваш сервер, если ваш сервер более ранний или более
      поздний, чем мой. Так же вы можете настроить количество очков, получаемых на событиях Сильнейшее королевство и
      Экстремальная мощь.
    </Text>
    <Title order={2}>Напутствие</Title>
    <Text>
      Калькулятор разбратывается без какой-либо целенаправленной поддержки, исключительно моими силами и исключительно
      по моему желанию.
    </Text>
    <Text>Буду рад вашим отзывам, предложениям, вопросам и замечаниям по калькулятору.</Text>
    <Flex gap={8} align="center">
      <Text size="sm" ta="end">
        [KMZ] DonLi, S1574
      </Text>
      <a href="https://t.me/DonLi_V" target="_blank" rel="noreferrer">
        <FaTelegram color="#29B6F6" size={24} />
      </a>
    </Flex>
  </Stack>
))

export default AboutPage
